//package leetcode;
//
///**
// * 85. 最大矩形
// * @author: wyj
// * @date: 2021/07/09
// */
//public class Fail85_MaximumRectangle {
//    /**
//     * 给定一个仅包含 0 和 1 、大小为 rows x cols 的二维二进制矩阵，找出只包含 1 的最大矩形，并返回其面积。
//     *  示例 1：
//     * 输入：matrix = [
//     * ["1","0","1","0","0"],
//     * ["1","0","1","1","1"],
//     * ["1","1","1","1","1"],
//     * ["1","0","0","1","0"]]
//     * 输出：6
//     * 解释：最大矩形如上图所示。
//     *  示例 2：
//     * 输入：matrix = []
//     * 输出：0
//     *  示例 3：
//     * 输入：matrix = [["0"]]
//     * 输出：0
//     *  示例 4：
//     * 输入：matrix = [["1"]]
//     * 输出：1
//     *  示例 5：
//     * 输入：matrix = [["0","0"]]
//     * 输出：0
//     *
//     * 最大正方形的变种题型，但是最大正方形可以用动态规划来解题，这题好像并非如此
//     */
//    public int maximalRectangle(char[][] matrix) {
//
//    }
//}
